In [214]:
# Use Shift + Tab for function signature

In [3]:
import pandas as pd

In [204]:
info_dict = {
    'Name' : ['Priyang', 'Aradhya','Krishna','Vedant','Parshv','Mittal', 'Archana','Radhika'],
    'Marks' : [90, 82, 51, 76, 95, 60, 42, 76],
    'Gender' : ['Male', 'Female', 'Male', 'Male', 'Male', 'Male', 'Female','Female'],
    'Weight' : [55,49,58,61,48,52,62, 54]
}

In [205]:
info_df = pd.DataFrame(info_dict, index=info_dict['Name'])
info_df

            Name  Marks  Gender  Weight
Priyang  Priyang     90    Male      55
Aradhya  Aradhya     82  Female      49
Krishna  Krishna     51    Male      58
Vedant    Vedant     76    Male      61
Parshv    Parshv     95    Male      48
Mittal    Mittal     60    Male      52
Archana  Archana     42  Female      62
Radhika  Radhika     76  Female      54

### Display top 3 rows of the dataframe

In [19]:
info_df.head(3)

      Name  Marks  Gender
0  Priyang     90    Male
1  Aradhya     92  Female
2  Krishna     91    Male

### Display last 3 rows of the dataframe

In [20]:
info_df.tail(3)

      Name  Marks  Gender
4   Parshv     95    Male
5   Mittal     90    Male
6  Archana     92  Female

### Find shape of the dataset (rows and columns)

In [23]:
info_df.shape

(7, 3)

### Get basic information about the dataset (No. of row, columsn, memory requirement, datatypes)

In [25]:
info_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

### Check for null-values

In [29]:
info_df.isnull() # isna also works

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [36]:
info_df.isnull().sum(axis = 0) # default is axis 0

Name      0
Marks     0
Gender    0
dtype: int64

In [33]:
info_df.isnull().sum(axis=1)

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

### Get overall statistics about the dataframe

In [37]:
info_df.describe() # By default gives information about numberical columns

           Marks
count   7.000000
mean   92.285714
std     2.360387
min    90.000000
25%    90.500000
50%    92.000000
75%    93.500000
max    96.000000

In [40]:
info_df.describe(include ='all') # Inclues numerical as well as categorical columns

           Name      Marks Gender
count         7   7.000000      7
unique        7        NaN      2
top     Priyang        NaN   Male
freq          1        NaN      5
mean        NaN  92.285714    NaN
std         NaN   2.360387    NaN
min         NaN  90.000000    NaN
25%         NaN  90.500000    NaN
50%         NaN  92.000000    NaN
75%         NaN  93.500000    NaN
max         NaN  96.000000    NaN

### Find unique values from the gender column

In [56]:
info_df['Gender'].unique()

array(['Male', 'Female'], dtype=object)

### Find number of unique values from the gender column

In [57]:
info_df['Gender'].nunique()

2

### Find count of unique values from the gender column

In [68]:
info_df.groupby('Gender').count()

        Name  Marks
Gender
Female     2      2
Male       5      5

In [74]:
info_df['Gender'].value_counts() ## preferred way using value_counts

Gender
Male      5
Female    2
Name: count, dtype: int64

### Find total no of students having marks between 95 and 100`

#### Using boolean indexing

In [112]:
contd = (info_df['Marks'] >= 95) & (info_df['Marks'] <=100) # Brackets needed / Boolean series is generated / Can be used for indexing
contd

0    False
1    False
2    False
3     True
4     True
5    False
6    False
Name: Marks, dtype: bool

In [108]:
len(info_df[contd]) # Using length we can find out the count

2

In [103]:
info_df[contd]['Name']

3    Vedant
4    Parshv
Name: Name, dtype: object

#### Using between method / Both inclusive

In [115]:
sum(info_df['Marks'].between(95, 100)) # Use sum to find the total numbers

2

###  Find average marks

In [117]:
info_df['Marks'].mean()

92.28571428571429

### Apply Method (To define user defined functions on a cloumn value)

#### Without lambda function

In [157]:
def marks(x):
    grade_dict = {
        90 : 'A+',
        80 : 'A',
        70 : 'B+',
        60 : 'B',
        50 : 'C'
    }
    if x//10 * 10 < 50:
        return 'D'
    return grade_dict[(x//10) * 10]

In [158]:
info_df['Grade'] = info_df['Marks'].apply(marks)
info_df

      Name  Marks  Gender  Weight Grade
0  Priyang     90    Male      55    A+
1  Aradhya     82  Female      49     A
2  Krishna     51    Male      58     C
3   Vedant     76    Male      61    B+
4   Parshv     95    Male      48    A+
5   Mittal     60    Male      52     B
6  Archana     42  Female      62     D

#### With Lambda function (anonymous)

In [159]:
info_df['Remarks'] = info_df['Grade'].apply(lambda x : 'Above avergae' if x in ['A+','A','B+','B','C+','C'] else 'Below average')

In [160]:
info_df

      Name  Marks  Gender  Weight Grade        Remarks
0  Priyang     90    Male      55    A+  Above avergae
1  Aradhya     82  Female      49     A  Above avergae
2  Krishna     51    Male      58     C  Above avergae
3   Vedant     76    Male      61    B+  Above avergae
4   Parshv     95    Male      48    A+  Above avergae
5   Mittal     60    Male      52     B  Above avergae
6  Archana     42  Female      62     D  Below average

#### With in-built functions

In [161]:
info_df['Name'].apply(len)

0    7
1    7
2    7
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

### Map function

In [164]:
info_df['Gender Map']= info_df['Gender'].map({'Male' : 1, 'Female' : 2})

In [165]:
info_df

      Name  Marks  Gender  Weight Grade        Remarks  Gender Map
0  Priyang     90    Male      55    A+  Above avergae           1
1  Aradhya     82  Female      49     A  Above avergae           2
2  Krishna     51    Male      58     C  Above avergae           1
3   Vedant     76    Male      61    B+  Above avergae           1
4   Parshv     95    Male      48    A+  Above avergae           1
5   Mittal     60    Male      52     B  Above avergae           1
6  Archana     42  Female      62     D  Below average           2

### Drop column(s)

In [180]:
info_df.drop(['Gender Map', 'Weight'], axis = 1, inplace = True)
info_df

      Name  Marks  Gender Grade        Remarks
0  Priyang     90    Male    A+  Above avergae
1  Aradhya     82  Female     A  Above avergae
2  Krishna     51    Male     C  Above avergae
3   Vedant     76    Male    B+  Above avergae
4   Parshv     95    Male    A+  Above avergae
5   Mittal     60    Male     B  Above avergae
6  Archana     42  Female     D  Below average

### Display names of columns

In [187]:
info_df.columns # Attribute of a pandas dataframe

Index(['Name', 'Marks', 'Gender', 'Grade', 'Remarks'], dtype='object')

### Display names of rows

In [193]:
info_df.index

Index(['Priyang', 'Aradhya', 'Krishna', 'Vedant', 'Parshv', 'Mittal',
       'Archana'],
      dtype='object')

### Sort the dataframe as per the marks columns

In [198]:
info_df['Marks'].sort_index()

Aradhya    82
Archana    42
Krishna    51
Mittal     60
Parshv     95
Priyang    90
Vedant     76
Name: Marks, dtype: int64

In [209]:
info_df.sort_values(by='Marks') # Better way using sort_values function

            Name  Marks  Gender  Weight
Archana  Archana     42  Female      62
Krishna  Krishna     51    Male      58
Mittal    Mittal     60    Male      52
Vedant    Vedant     76    Male      61
Radhika  Radhika     76  Female      54
Aradhya  Aradhya     82  Female      49
Priyang  Priyang     90    Male      55
Parshv    Parshv     95    Male      48

#### Sort values by more than one column

In [215]:
info_df.sort_values(by=['Marks','Name'], ascending=False)

            Name  Marks  Gender  Weight
Parshv    Parshv     95    Male      48
Priyang  Priyang     90    Male      55
Aradhya  Aradhya     82  Female      49
Vedant    Vedant     76    Male      61
Radhika  Radhika     76  Female      54
Mittal    Mittal     60    Male      52
Krishna  Krishna     51    Male      58
Archana  Archana     42  Female      62

### Display Name and Marks of the female students

#### Using boolean indexing

In [228]:
info_df[info_df['Gender'] == 'Female'][['Marks', 'Name']]

         Marks     Name
Aradhya     82  Aradhya
Archana     42  Archana
Radhika     76  Radhika

#### Using Boolean indexing using isin()

In [232]:
info_df[info_df['Gender'].isin(['Female'])][['Name','Marks']]

            Name  Marks
Aradhya  Aradhya     82
Archana  Archana     42
Radhika  Radhika     76